MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mk22fn512cap12.s
    .weak      Reserved83_IRQHandler
    .thumb_set Reserved83_IRQHandler,Default_Handler

    .weak      Reserved84_IRQHandler
    .thumb_set Reserved84_IRQHandler,Default_Handler

    .weak      Reserved85_IRQHandler
    .thumb_set Reserved85_IRQHandler,Default_Handler

    .weak      Reserved86_IRQHandler
    .thumb_set Reserved86_IRQHandler,Default_Handler

    .weak      FTM3_IRQHandler
    .thumb_set FTM3_IRQHandler,Default_Handler

    .weak      DAC1_IRQHandler
    .thumb_set DAC1_IRQHandler,Default_Handler

    .weak      ADC1_IRQHandler
    .thumb_set ADC1_IRQHandler,Default_Handler

    .weak      Reserved90_IRQHandler
    .thumb_set Reserved90_IRQHandler,Default_Handler

    .weak      Reserved91_IRQHandler
    .thumb_set Reserved91_IRQHandler,Default_Handler

    .weak      Reserved92_IRQHandler
    .thumb_set Reserved92_IRQHandler,Default_Handler

    .weak      Reserved93_IRQHandler
    .thumb_set Reserved93_IRQHandler,Default_Handler

    .weak      Reserved94_IRQHandler
    .thumb_set Reserved94_IRQHandler,Default_Handler

    .weak      Reserved95_IRQHandler
    .thumb_set Reserved95_IRQHandler,Default_Handler

    .weak      Reserved96_IRQHandler
    .thumb_set Reserved96_IRQHandler,Default_Handler

    .weak      Reserved97_IRQHandler
    .thumb_set Reserved97_IRQHandler,Default_Handler

    .weak      Reserved98_IRQHandler
    .thumb_set Reserved98_IRQHandler,Default_Handler

    .weak      Reserved99_IRQHandler
    .thumb_set Reserved99_IRQHandler,Default_Handler

    .weak      Reserved100_IRQHandler
    .thumb_set Reserved100_IRQHandler,Default_Handler

    .weak      Reserved101_IRQHandler
    .thumb_set Reserved101_IRQHandler,Default_Handler
